[
  {
    "title": "HTML",
    "description": "HTML is a markup language used for structuring and presenting content on the World Wide Web. It is the fifth and current major version of the HTML standard, and subsumes XHTML.",
    "image": "./undrawArts/undraw_build.svg",
    "fontAwesomeIcon": "fab fa-html5"
  },
  {
    "title": "CSS",
    "description": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language such as HTML. CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",
    "image": "./undrawArts/undraw_style.svg",
    "fontAwesomeIcon": "fab fa-css3-alt"
  },
  {
    "title": "JavaScript",
    "description": "JavaScript, often abbreviated as JS, is a programming language that conforms to the ECMAScript specification. JavaScript is high-level, often just-in-time compiled, and multi-paradigm. It has curly-bracket syntax, dynamic typing, prototype-based object-orientation, and first-class functions.",
    "image": "./undrawArts/undraw_programming.svg",
    "fontAwesomeIcon": "fab fa-js"
  },
  {
    "title": "React",
    "description": "React is an open-source, front end, JavaScript library for building user interfaces or UI components. It is maintained by Facebook and a community of individual developers and companies.",
    "image": "./undrawArts/undraw_react.svg",
    "fontAwesomeIcon": "fab fa-react"
  },
  {
    "title": "TypeScript",
    "description": "TypeScript is an open-source language which builds on JavaScript, one of the world's most used tools, by adding static type definitions.",
    "image": "./undrawArts/undraw_typing.svg",
    "fontAwesomeIcon": "far fa-keyboard"
  },
  {
    "title": "Java",
    "description": "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible. It is intended to let application developers \"write once, run anywhere\" (WORA), meaning that compiled Java code can run on all platforms that support Java without the need for recompilation.",
    "image": "./undrawArts/undraw_coffee.svg",
    "fontAwesomeIcon": "fab fa-java"
  },
  {
    "title": "Spring",
    "description": "Spring is an application framework and inversion of control container for the Java platform. The framework's core features can be used by any Java application, but there are extensions for building web applications on top of the Java EE platform.",
    "image": "./undrawArts/undraw_spring.svg",
    "fontAwesomeIcon": "fas fa-seedling"
  }
]
